PROG: PROC OPTIONS(MAIN);
/* multiple lines comment
two 
line */
dcl x fixed bin(15);
dcl y fixed bin(31);
dcl z char(10);
  x = 10;
  if x = 10
  then
    put skip list('x=', 10);  
  else  
    put skip list('x<>', 10);   
  x = x + (10 * 2);
  put skip list('x + 10 * 2 = ', x);   
end PROG;